{
  "_name_or_path": "bert-base-uncased",
  "architectures": [
    "RBERT"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "finetuning_task": "semeval",
  "gradient_checkpointing": false,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "attributed-to",
    "1": "compromises",
    "10": "actived-on",
    "11": "similar-to",
    "12": "belongs-to",
    "13": "associated-with",
    "14": "",
    "15": "",
    "2": "controls",
    "3": "hosts",
    "4": "located-at",
    "5": "originates-from",
    "6": "targets",
    "7": "uses",
    "8": "variant-of",
    "9": "operated-on"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "": 15,
    "actived-on": 10,
    "associated-with": 13,
    "attributed-to": 0,
    "belongs-to": 12,
    "compromises": 1,
    "controls": 2,
    "hosts": 3,
    "located-at": 4,
    "operated-on": 9,
    "originates-from": 5,
    "similar-to": 11,
    "targets": 6,
    "uses": 7,
    "variant-of": 8
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "torch_dtype": "float32",
  "transformers_version": "4.37.2",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 30522
}
